/*
 ** Temp **
 * these will all come from CMS in the future
 */

const defaultTexts = {
    shortKhutba: {
        beginning:
            'بِسْمِ اللهِ، الْحَمْدُ لِلَّهِ، وَالصَّلَاةُ وَالسَّلَامُ عَلَىٰ رَسُولِ اللهِ، أَمَّا بَعْد',
        middle1: 'أَقُولُ قَوْلِي هَذَا، وَأَسْتَغْفِرُ اللهَ لِي وَلَكُمْ',
        middle2:
            'الْحَمْدُ لِلَّهِ، وَالصَّلَاةُ وَالسَّلَامُ عَلَىٰ رَسُولِ اللهِ، رَبَّنَآ اٰتِنَا فِىْ الدُّنْيَا حَسَنَةً وَّفِىْ الْاٰخِرَةِ حَسَنَةً وَّقِنَا عَذَابَ النَّارِ وَأَقِيمُوا الصَّلَاة',
        ending: 'رَبَّنَآ اٰتِنَا فِىْ الدُّنْيَا حَسَنَةً وَّفِىْ الْاٰخِرَةِ حَسَنَةً وَّقِنَا عَذَابَ النَّارِ وَأَقِيمُوا الصَّلَاة',
        beginningTranslation:
            'In the name of Allah, praise be to Allah, and may blessings and peace be upon the Messenger of Allah, now then:',
    },
    mediumKhutba: {
        beginning:
            'الْحَمْدُ لِلَّهِ نَحْمَدُهُ وَنَسْتَعِينُهُ وَنَسْتَغْفِرُهُ، وَنَعُوذُ بِاللَّهِ مِنْ شُرُورِ أَنْفُسِنَا وَمِنْ سَيِّئَاتِ أَعْمَالِنَا، مَنْ يَهْدِهِ اللَّهُ فَلَا مُضِلَّ لَهُ وَمَنْ يُضْلِلْ فَلَا هَادِيَ لَهُ، وَأَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، وَأَنَّ مُحَمَّدًا صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَبْدُهُ وَرَسُولُهُ، قَالَ اللهُ تَعَالَى يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ حَقَّ تُقَاتِهِ وَلَا تَمُوتُنَّ إِلَّا وَأَنْتُمْ مُسْلِمُونَ إِنَّ أَصْدَقَ الْحَدِيثِ كِتَابُ اللَّهِ، وَأَحْسَنَ الْهَدْيِ هَدْيُ مُحَمَّدٍ، صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، وَشَرُّ الْأُمُورِ مُحْدَثَاتُهَا، وَكُلُّ مُحْدَثَةٍ بِدْعَةٌ، وَكُلُّ بِدْعَةٍ ضَلَالَةٌ، وَكُلُّ ضَلَالَةٍ فِي النَّارِ، أَمَّا بَعْدُ',
        middle1:
            'أَقُولُ قَوْلِي هَذَا، وَأَسْتَغْفِرُ اللهَ لِي وَلَكُمْ، فَاسْتَغْفِرُوهُ إِنَّهُ هُوَ الغَفُورُ الرَّحِيمُ',
        middle2:
            'الْحَمْدُ لِلَّهِ، وَالصَّلَاةُ وَالسَّلَامُ عَلَىٰ رَسُولِ اللهِ',
        ending: "اللّٰھُمَّ صَلِّ وَبَارِكْ عَلَی مُحَمَّدٍ، وَعَلَی آلِ مُحَمَّدٍ، کَمَا صَلَّیْتَ وَبَارَكْتَ عَلَی إِبْرَاھِیمَ، وَعَلَی آلِ إِبْرَاھِیمَ، اِنَّكَ حَمِیْدٌ مَّجِیْدٌ\n\nrecite one or more du'aa beginning with Rabbana… (example given)]\n\nرَبَّنَا تَقَبَّلْ مِنَّا إِنَّكَ أَنْتَ السَّمِيعُ الْعَلِيمُ عِبَادَ اللهِ، إِنَّ اللَّهَ يَأْمُرُ بِالْعَدْلِ وَالْإِحْسَانِ، وَإِيتَاءِ ذِي الْقُرْبَى، وَيَنْهَى عَنِ الْفَحْشَاءِ وَالْمُنْكَرِ وَالْبَغْي، يَعِظُكُمْ لَعَلَّكُمْ تَذَكَّرُونَ، وَلَذِكْرِ اللهِ أَكْبَرُ، واللهُ يَعْلَمُ مَا تَصْنَعُوْنَ.",
    },
    longKhutba: {
        beginning:
            'الْحَمْدُ لِلَّهِ نَحْمَدُهُ وَنَسْتَعِينُهُ وَنَسْتَغْفِرُهُ، وَنَعُوذُ بِاللَّهِ مِنْ شُرُورِ أَنْفُسِنَا وَمِنْ سَيِّئَاتِ أَعْمَالِنَا، مَنْ يَهْدِهِ اللَّهُ فَلَا مُضِلَّ لَهُ وَمَنْ يُضْلِلْ فَلَا هَادِيَ لَهُ، وَأَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، وَأَنَّ مُحَمَّدًا صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَبْدُهُ وَرَسُولُهُ، قَالَ اللهُ تَعَالَى يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ حَقَّ تُقَاتِهِ وَلَا تَمُوتُنَّ إِلَّا وَأَنْتُمْ مُسْلِمُونَ وقَالَ تَعَالَى يَـٰأَيُّهَا النَّاسُ اتَّقُوا۟ رَبَّكُمُ الَّذِى خَلَقَكُم مِّن نَّفْسٍ وَٰحِدَةٍ وَخَلَقَ مِنْهَا زَوْجَهَا وَبَثَّ مِنْهُمَا رِجَالًا كَثِيرًا وَنِسَآءً وَاتَّقُوا اللَّهَ الَّذِي تَسَاءَلُونَ بِهِ وَالْأَرْحَامَ إِنَّ اللَّهَ كَانَ عَلَيْكُمْ رَقِيبًا وقَالَ تَعَالَى يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَقُولُوا قَوْلًا سَدِيدًا يُصْلِحْ لَكُمْ أَعْمَالَكُمْ وَيَغْفِرْ لَكُمْ ذُنُوبَكُمْ وَمَنْ يُطِعِْ اللَّهَ وَرَسُولَهُ فَقَدْ فَازَ فَوْزًا عَظِيمًا إِنَّ أَصْدَقَ الْحَدِيثِ كِتَابُ اللَّهِ، وَأَحْسَنَ الْهَدْيِ هَدْيُ مُحَمَّدٍ، صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، وَشَرُّ الْأُمُورِ مُحْدَثَاتُهَا، وَكُلُّ مُحْدَثَةٍ بِدْعَةٌ، وَكُلُّ بِدْعَةٍ ضَلَالَةٌ، وَكُلُّ ضَلَالَةٍ فِي النَّارِ، أَمَّا بَعْدُ',
        middle1:
            'أَقُولُ قَوْلِي هَذَا، وَأَسْتَغْفِرُ اللهَ لِي وَلَكُمْ، فَاسْتَغْفِرُوهُ وَتُوبُوا إِلَيْهِ، إِنَّهُ هُوَ الغَفُورُ الرَّحِيمُ',
        middle2:
            'إِنَّ الْحَمْدَ لِلَّهِ، وَالصَّلَاةُ وَالسَّلَامُ عَلَىٰ رَسُولِ اللهِ',
        ending: "قَالَ اللَّهُ تَعَالَى إِنَّ اللَّهَ وَمَلَائِكَتَهُ يُصَلُّونَ عَلَى النَّبِيِّ يَا أَيُّهَا الَّذِينَ آمَنُوا صَلُّوا عَلَيْهِ وَسَلِّمُوا تَسْلِيمًا: اللّٰھُمَّ صَلِّ عَلَی مُحَمَّدٍ، وَعَلَی آلِ مُحَمَّدٍ، کَمَا صَلَّیْتَ عَلَی إِبْرَاھِیمَ، وَعَلَی آلِ إِبْرَاھِیمَ، اِنَّكَ حَمِیْدٌ مَّجِیْدٌ اللّٰھُمَّ بَارِكْ عَلَی مُحَمَّدٍ، وَعَلَی آلِ مُحَمَّدٍ، کَمَا بَارَکْتَ عَلَی إِبْرَاھِیمَ، وَعَلَی آلِ إِبْرَاھِیمَ، اِنَّكَ حَمِیْدٌ مَّجِیْدٌ وَصَلِّ وَعَلَى الْخُلَفَاءِ الرَّاشِدِيْنَ الْمَهْدِيِّيْنَ، أَبِيْ بَكْرٍ وعُمَرَ وَعثْمَانَ وَعَلِىّ، وَعَلَى أَزْوَاجِ النَّبِيِّ أُمَّهَاتِ الْمُؤْمِنِيْنَ، وَعَلَى سَائِرِ الصَّحَابَةِ والتَّابِعِيْنَ، وَمَنْ تَبِعَهُمْ إِلىَ يَوْمِ الدِّيْنِ. الّلهُمَّ انْصُرْ مَنْ نَصَرَ دِيْنَ مُحَمَّدٍ ﷺ وَاجْعَلْنَا مِنْهُمْ، وَاخْذُلْ مَنْ خَذَلَ دِيْنَ مُحَمَّدٍ ﷺ وَلَا تَجْعَلْنَا مِنْهُم،\n\nRecite one or more du'aa beginning with Rabbana… (example given)\n\nرَبَّنَا تَقَبَّلْ مِنَّا إِنَّكَ أَنْتَ السَّمِيعُ الْعَلِيمُ\n\nOther du'aa as you wish…\n\nعِبَادَ اللهِ، رَحِمَكُمُ اللهُ، إِنَّ اللَّهَ يَأْمُرُ بِالْعَدْلِ وَالْإِحْسَانِ، وَإِيتَاءِ ذِي الْقُرْبَى، وَيَنْهَى عَنِ الْفَحْشَاءِ وَالْمُنْكَرِ وَالْبَغْي، يَعِظُكُمْ لَعَلَّكُمْ تَذَكَّرُونَ وَلَذِكْرِ اللهِ تَعَالَى أَعْلَى وَأَكْبَرُ واللهُ يَعْلَمُ مَا تَصْنَعُوْنَ",
    },
};

export default defaultTexts;
